In [2]:
import pandas as pd
import os

In [3]:
sales = pd.read_excel("Sales Data.xlsx")
sales.head()

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179

In [4]:
sales.isna().sum()

Sales Person    0
Geography       0
Product         0
Date            0
Amount          0
Boxes           0
dtype: int64

In [5]:
sales.shape

(3791, 6)

In [ ]:
#Using loc
[0,2,4,6]
#extracts rows with the specified index numbers. Loc works with both integers and string
sales.loc[[0,2,4,6]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
6,Oby Sorrel,UK,Raspberry Choco,2021-01-01,1057,71

In [ ]:
#Using iloc
#iloc works with only integers
sales.iloc[[0,2,4,6]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
6,Oby Sorrel,UK,Raspberry Choco,2021-01-01,1057,71

In [8]:
sales.columns

Index(['Sales Person', 'Geography', 'Product', 'Date', 'Amount', 'Boxes'], dtype='object')

In [ ]:
#indexing columns
#this prints out the rows, columns based on the specified row indexes and column names
sales.loc[[0,2,4,7], ["Sales Person", "Product", "Amount"]]

       Sales Person              Product  Amount
0      Barr Faughny      Raspberry Choco    8414
2  Karlen McCaffrey      99% Dark & Pure    5376
4    Beverie Moffet   Manuka Honey Choco    5530
7    Dotty Strutley  Organic Choco Syrup    1036

In [ ]:
#prints out the rows with index number 0,2,4,7 and columns with index number 0,1,2,3
sales.iloc[[0,2,4,7], [0,1,2,3]]

       Sales Person      Geography              Product       Date
0      Barr Faughny    New Zealand      Raspberry Choco 2021-01-01
2  Karlen McCaffrey            USA      99% Dark & Pure 2021-01-01
4    Beverie Moffet            USA   Manuka Honey Choco 2021-01-01
7    Dotty Strutley      Australia  Organic Choco Syrup 2021-01-01

In [ ]:
#Slicing using iloc and loc

#these prints out all the rows and columns
sales.iloc[::]
sales.iloc[:]
sales.iloc[0:-1]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
...,...,...,...,...,...,...
3785,Roddy Speechley,UK,70% Dark Bites,2022-01-04,8225,412
3786,Van Tuxwell,India,Drinking Coco,2022-01-19,10682,1526
3787,Rafaelita Blaksland,Australia,Mint Chip Choco,2022-01-18,11746,511
3788,Kelci Walkden,Australia,Spicy Special Slims,2022-01-03,8862,1477
3789,Gunar Cockshoot,New Zealand,Mint Chip Choco,2022-01-21,11592,527

In [ ]:
#Using loc
#these prints out all the rows and columns
sales.loc[:]
sales.loc[::]
sales.loc[-1:] #[:-1] prints out just the column headers

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
...,...,...,...,...,...,...
3786,Van Tuxwell,India,Drinking Coco,2022-01-19,10682,1526
3787,Rafaelita Blaksland,Australia,Mint Chip Choco,2022-01-18,11746,511
3788,Kelci Walkden,Australia,Spicy Special Slims,2022-01-03,8862,1477
3789,Gunar Cockshoot,New Zealand,Mint Chip Choco,2022-01-21,11592,527
3790,Mallorie Waber,USA,Spicy Special Slims,2022-01-07,3871,431

In [19]:
sales.columns

Index(['Sales Person', 'Geography', 'Product', 'Date', 'Amount', 'Boxes'], dtype='object')

In [ ]:
#Using loc and iloc to slice columns
#this prints out rows from index number 0 to 4 and columns from sales person to amount
sales.loc[0:4, "Sales Person": "Amount"]

          Sales Person      Geography              Product       Date  Amount
0         Barr Faughny    New Zealand      Raspberry Choco 2021-01-01    8414
1  Dennison Crosswaite         Canada           White Choc 2021-01-01     532
2     Karlen McCaffrey            USA      99% Dark & Pure 2021-01-01    5376
3         Barr Faughny    New Zealand  Baker's Choco Chips 2021-01-01     259
4       Beverie Moffet            USA   Manuka Honey Choco 2021-01-01    5530

In [24]:
#using iloc for integers and index numbers
sales.iloc[0:4, 0:5]

          Sales Person      Geography              Product       Date  Amount
0         Barr Faughny    New Zealand      Raspberry Choco 2021-01-01    8414
1  Dennison Crosswaite         Canada           White Choc 2021-01-01     532
2     Karlen McCaffrey            USA      99% Dark & Pure 2021-01-01    5376
3         Barr Faughny    New Zealand  Baker's Choco Chips 2021-01-01     259

In [ ]:
#this prints out all of the rows and columns with index number 1 to 3
sales.iloc[0:-1, 1:4]

          Geography              Product       Date
0       New Zealand      Raspberry Choco 2021-01-01
1            Canada           White Choc 2021-01-01
2               USA      99% Dark & Pure 2021-01-01
3       New Zealand  Baker's Choco Chips 2021-01-01
4               USA   Manuka Honey Choco 2021-01-01
...             ...                  ...        ...
3785           UK         70% Dark Bites 2022-01-04
3786         India         Drinking Coco 2022-01-19
3787     Australia       Mint Chip Choco 2022-01-18
3788     Australia   Spicy Special Slims 2022-01-03
3789   New Zealand       Mint Chip Choco 2022-01-21

[3790 rows x 3 columns]

In [26]:
#indexing using loc and iloc
#this sets Geography as the index
sales.set_index("Geography", inplace=True)

In [27]:
sales.head(3)

                    Sales Person          Product       Date  Amount  Boxes
Geography
New Zealand         Barr Faughny  Raspberry Choco 2021-01-01    8414    495
 Canada      Dennison Crosswaite       White Choc 2021-01-01     532     54
 USA            Karlen McCaffrey  99% Dark & Pure 2021-01-01    5376    269